{
  "users": [
    {
      "id": "1",
      "email": "user@test.com",
      "password": "password123",
      "firstName": "Test",
      "lastName": "User",
      "role": "EMPLOYEE"
    },
    {
      "id": "9e6f",
      "firstName": "Test ",
      "lastName": "User",
      "email": "testUser@gmail.com",
      "password": "password123"
    }
  ],
  "favoritesOffers": [
    {
      "id": "20c8",
      "slug": "remote-marketing-student-munich-12978",
      "company_name": "SolarEdge",
      "title": "Marketing Student",
      "description": "<p><strong>Are you ready to power the future? </strong></p><p><strong>At SolarEdge (NASDAQ: SEDG), we're a global leader in smart energy technology, with over 4,000 employees, offices in 34 countries, and millions of installations worldwide.</strong></p><p><strong>Our innovative solutions include solar inverters, battery storage, backup systems, EV charging, and AI-based energy management. We're committed to making clean, green energy the primary power source for homes, businesses, and beyond.</strong></p><p><strong>With the growing demand for electricity, the need for smart, clean energy sources is constantly rising. SolarEdge offers amazing opportunities to develop your skills in a multidisciplinary environment, covering everything from research and development to production and customer supply. Work with talented colleagues, tackle exciting challenges, and help create a sustainable future in an industry that's always evolving and innovating. Join us and be part of a company that values creativity, agility, and impactful work.&nbsp;</strong></p><p>The EU Marketing team is made up of highly creative, competent, marketing professionals, who are capable of thinking and doing at the same time. In your role, you’ll be expected to support the implementation of marketing activities and events to sustain the SolarEdge’s marketing strategy with the vision based on SolarEdge being the prosumers #1 choice for smart energy solutions. Your touch points are mostly B2B but with increasing emphasis on B2B2C.</p><p>You will report directly to the Director of Marcom Europe and indirectly to the Country Managers Germany and Austria/Switzerland. You will have marketing responsibilities spanning the regional markets in DACH (Germany, Austria and Switzerland).&nbsp;</p><p>In order to achieve this, you must:</p><ul><li>Have a good understanding of your markets and customers - distributors, installers and prosumers (people who produce and consume energy) - and use this knowledge to communicate effectively. </li><li>Learn about the SolarEdge products and services you are selling and why, so that you accomplish set marketing activities relating to our product range efficiently and accurately.</li><li>Make it easier for prosumers in DACH to access SolarEdge’s smart energy solutions, by ensuring our Marcom activities tune-in their needs. For example, ensuring we have the right stocks of meaningful collaterals translated to a high standard.</li></ul><p><strong>Responsibilities (not exclusively)</strong></p><ul><li>Being a proud Ambassador of the SolarEdge brand, giving a good impression during all customer-facing interactions </li><li>Help to deliver relevant local digital content on the web and social media platforms on time, such as the creation of newsletters and social media posts </li><li>Support for local marketing managers in organizing and running local exhibitions, trade fairs, events, training courses and road shows</li><li>Support of channel partners with local exhibitions and events</li><li>Managing the collaterals supply chain, mainly printed materials and giveaways</li><li>Order marketing product (dummy equipment) for events or customer showrooms</li><li>Reviewing and doing translations from English into German&nbsp;</li></ul><p><br></p><br/><br/>Country: <br/>Germany<br/><br/>City: <br/>Munich<br><strong>Requirements</strong><br><p><strong>Requirements </strong></p><ul><li>Languages: Native German (essential), fluent in English.</li><li>You will be capable of demonstrating the following soft skills and attributes.</li><li>Secure, experienced handling of MS-Office, especially Excel and PowerPoint.</li><li>Strong team player.</li><li>Exemplary clear communication skills, both written and verbal.</li><li>Affinity to technological products desirable, but not a must.</li><li>Affinity and experiences in dealing with social media (Facebook, LinkedIn, Twitter, Instagram) desirable.</li><li>Meticulous planning, prioritizing and organization skills.</li><li>Highly reliable, doing what you say you will do, always and meeting deadlines.</li><li>Ability to multi-task, stay calm under pressure and retain cross-group collaborations.</li><li>Easily build a rapport with both your coworkers and customers.</li><li>Solid analytical skills with consistent attention to detail and also good with numbers.</li></ul><p><br></p><p>Find more <a href=\"https://www.arbeitnow.com/english-speaking-jobs\">English Speaking Jobs in Germany</a> on Arbeitnow</a>",
      "remote": true,
      "url": "https://www.arbeitnow.com/jobs/companies/solaredge/remote-marketing-student-munich-12978",
      "tags": [
        "Remote"
      ],
      "job_types": [
        "Hourly"
      ],
      "location": "Munich",
      "created_at": 1770975729,
      "userId": "1"
    }
  ],
  "applications": [
    {
      "id": "1",
      "userId": "1",
      "jobId": "job_1",
      "status": "PENDING",
      "appliedAt": "2023-10-27T10:00:00Z"
    }
  ]
}